#### Ordinal Number Encoding

In [1]:
import pandas as pd
import numpy as np
import datetime

In [2]:
today = datetime.datetime.today()
today

datetime.datetime(2020, 11, 17, 14, 2, 14, 347449)

In [3]:
days = [today-datetime.timedelta(x) for x in range(0,19)]
days

[datetime.datetime(2020, 11, 17, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 16, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 15, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 14, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 13, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 12, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 11, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 10, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 9, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 8, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 7, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 6, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 5, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 4, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 3, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 2, 14, 2, 14, 347449),
 datetime.datetime(2020, 11, 1, 14, 2, 14, 347449),
 datetime.datetime(2020, 10, 31, 14, 2, 14, 347449),
 datetime.datetime(2020, 10, 30, 14, 2, 14, 347449)]

In [4]:
df = pd.DataFrame(days,columns=['Days'])

In [5]:
df.head()

                        Days
0 2020-11-17 14:02:14.347449
1 2020-11-16 14:02:14.347449
2 2020-11-15 14:02:14.347449
3 2020-11-14 14:02:14.347449
4 2020-11-13 14:02:14.347449

In [6]:
df['weekday']=df['Days'].dt.weekday
df.head(10)

                        Days  weekday
0 2020-11-17 14:02:14.347449        1
1 2020-11-16 14:02:14.347449        0
2 2020-11-15 14:02:14.347449        6
3 2020-11-14 14:02:14.347449        5
4 2020-11-13 14:02:14.347449        4
5 2020-11-12 14:02:14.347449        3
6 2020-11-11 14:02:14.347449        2
7 2020-11-10 14:02:14.347449        1
8 2020-11-09 14:02:14.347449        0
9 2020-11-08 14:02:14.347449        6

#### Using Titanic dataset

In [7]:
df = pd.read_csv(r'C:\Users\admin\Downloads\Feature-Engineering-Live-sessions-master\titanic.csv',usecols=['Cabin','Survived'])
df.head(10)

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN
5         0   NaN
6         0   E46
7         0   NaN
8         1   NaN
9         1   NaN

In [8]:
df['Cabin'].fillna('Missing',inplace=True)

In [10]:
df['Cabin'] = df['Cabin'].str[0]

In [11]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [13]:
df.groupby(['Cabin'])['Survived'].mean().sort_values(ascending=False)

Cabin
D    0.757576
E    0.750000
B    0.744681
F    0.615385
C    0.593220
G    0.500000
A    0.466667
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [14]:
ordinal_value = df.groupby(['Cabin'])['Survived'].mean().sort_values(ascending=False).index
ordinal_value = list(ordinal_value)

In [16]:
ordinal_labels={k:i for i,k in enumerate(ordinal_value,0)}
ordinal_labels

{'D': 0, 'E': 1, 'B': 2, 'F': 3, 'C': 4, 'G': 5, 'A': 6, 'M': 7, 'T': 8}

In [17]:
df['Ordinal_Cabin'] = df['Cabin'].map(ordinal_labels)

In [18]:
df.head(10)

   Survived Cabin  Ordinal_Cabin
0         0     M              7
1         1     C              4
2         1     M              7
3         1     C              4
4         0     M              7
5         0     M              7
6         0     E              1
7         0     M              7
8         1     M              7
9         1     M              7

#### Mean Encoding

In [20]:
mean = df.groupby(['Cabin'])['Survived'].mean()
mean

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [21]:
mean.to_dict()

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [24]:
df['Mean_Cabin'] = df['Cabin'].map(mean)

In [25]:
df.head(10)

   Survived Cabin  Ordinal_Cabin  Mean_Cabin
0         0     M              7    0.299854
1         1     C              4    0.593220
2         1     M              7    0.299854
3         1     C              4    0.593220
4         0     M              7    0.299854
5         0     M              7    0.299854
6         0     E              1    0.750000
7         0     M              7    0.299854
8         1     M              7    0.299854
9         1     M              7    0.299854